InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<Comment>Контактная информация контрагентов, контактных лиц, организаций и сотрудников</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Comment>Признак значения по умолчанию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Comment>Вспомогательное поле: "Код страны" или "Индекс"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Comment>Вспомогательное поле: "Код города" или "Регион"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Comment>Вспомогательное поле: "Номер телефона" или "Район"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Comment>Вспомогательное поле: "Внутренний (или добавочный)  номер" или "Город"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Comment>Вспомогательное поле: "Населенный пункт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Comment>Вспомогательное поле: "Улица"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Comment>Вспомогательное поле: "Дом"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Comment>Вспомогательное поле: "Корпус"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Comment>Вспомогательное поле: "Квартира"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Строковое представление контактной информации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Comment>Вспомогательное поле: "Подъезд"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле11</Name>
					<Comment>Вспомогательное поле: "Этаж"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле12</Name>
					<Comment>Вспомогательное поле: "Код двери/домофон"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтанцияМетро</Name>
					<Comment>Станция метро</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииМетро</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГородскойРайон</Name>
					<Comment>Городской район проживания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_ПолеХраненияНомера</Name>
					<Comment>Индексирование тел. номера для поиска</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>31</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставление</Name>
					<Comment>Краткое представление</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект-владелец контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияГК</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип контактной информации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_КлиентскиеДанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_КлиентскиеДанные</Name>
			<Comment>Черновая временная версия архитектуры</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПредложенияИЗамечания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаВыбораМарки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПричиныВыбораМарки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаркаТекущегоАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаркаПредыдущегоАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписантВЛице</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписантНаОсновании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписантПодпись</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписантДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтказОтКонтакта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СогласиеНаПолучениеSMSДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_Трафик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_Трафик</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйИнтерес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПервичныйИнтерес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипАктивности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ТипыАктивностиТрафика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Закрытый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_РабочийЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипТрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТипТрафика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Администратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПервичныйПовторный</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ПервичныйПовторный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/CRM_Редубликация/Ext/Module.bsl
// Замена объектов на другой во всех местах, где имеются ссылки на заменяемый объект. 
// ИскомыйОбъект  - Объект который заменяем(Либо ссылка ибо массив ссылок на объекты)
//ОбъектНаЗамену - Объект который должны поставить на место ИскомыхОбъектов
//РежимТолькоПроверки  - Если истина  то функция только подтверждает наличие ссылок на искомые объекты
//ПомечатьНаУдаление - Если истина то замененые объекты помечаются на удаление
Функция ИскомыйОбъектСуществует(ИскомыйОбъект, ОбъектНаЗамену = Неопределено, РежимТолькоПроверки = Истина, ПомечатьНаУдаление = Истина) Экспорт
	
	Ответ = Ложь;
	//Если Есть что искать тогда
	Если ЗначениеЗаполнено(ИскомыйОбъект) Тогда
		МассивИскомыхСсылок = ИскомыйОбъект;
		//Создадим если необходимо массив с ссылками на искомые объекты
		Если Не (ТипЗнч(ИскомыйОбъект) = Тип ("Массив")) Тогда
			МассивИскомыхСсылок = новый Массив();
			МассивИскомыхСсылок.Добавить(ИскомыйОбъект);
		КонецЕсли;
		//Таблица ссылок на объекты где есть ссылки на искомые объекты
		ТаблицаСсылок = новый Массив;
		Если МассивИскомыхСсылок.Количество() > 0 Тогда
			ТаблицаСсылок = НайтиПоСсылкам(МассивИскомыхСсылок);
		КонецЕсли;
		ВсегоОб = ТаблицаСсылок.Количество();
		//Если не нужно заменять объекты
		Если  РежимТолькоПроверки  тогда
			Если ВсегоОб > 0 Тогда
				Ответ = истина;
			конецесли;
			//Иначе если есть на что заменять
		ИначеЕсли	НЕ(ОбъектНаЗамену =  Неопределено) Тогда
			Для Каждого ТекНайденныйОбъект Из ТаблицаСсылок Цикл
				//Для каждого найденного объекта в зависимости от принадлежности к группе метаданных 
				//выполняем Проверку и заполнение реквизитов где содржится искомый объект на объект замены
				Если ЭтоРегистрСведений(ТекНайденныйОбъект.метаданные) Тогда
					Запись = Неопределено;
					Итог = ПолучитьЗаписьИзРегистра(ТекНайденныйОбъект.Метаданные, ТекНайденныйОбъект.Данные, Запись);
					Если Итог тогда
						ПроверитьИЗаполнитьРеквизиты(ТекНайденныйОбъект.Метаданные.Ресурсы, Запись, ИскомыйОбъект, ОбъектНаЗамену);
						ПроверитьИЗаполнитьРеквизиты(ТекНайденныйОбъект.метаданные.Реквизиты, Запись, ИскомыйОбъект, ОбъектНаЗамену);
						ПроверитьИЗаполнитьРеквизиты(ТекНайденныйОбъект.метаданные.Измерения, Запись, ИскомыйОбъект, ОбъектНаЗамену);
						Попытка 
							Запись.Записать();
							
						Исключение
							Сообщить(ОписаниеОшибки());
						Конецпопытки;
					КонецЕсли;
									
				ИначеЕсли  ЭтоДокумент(ТекНайденныйОбъект.Метаданные)  Тогда
					Попытка 
						Запись = ТекНайденныйОбъект.Данные.ПолучитьОбъект();
						Запись.ОбменДанными.Загрузка = Истина;
						ПроверитьИЗаполнитьРеквизиты(ТекНайденныйОбъект.Метаданные.Реквизиты, Запись, ИскомыйОбъект, ОбъектНаЗамену);
						Для Каждого ТабЧасть из ТекНайденныйОбъект.Метаданные.ТабличныеЧасти цикл
							ПроверитьИЗаполнитьРеквизитыТЧ(ТабЧасть, Запись, ИскомыйОбъект, ОбъектНаЗамену);
						КонецЦикла;
						Если Запись.Проведен Тогда
							Попытка
								Запись.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
							Исключение
								Запись.Записать(РежимЗаписиДокумента.Запись);
							КонецПопытки;
						Иначе
							Запись.Записать(РежимЗаписиДокумента.Запись);
						КонецЕсли;
						
						Запись.Записать();
						
					Исключение
						//Сообщить(ОписаниеОшибки());
					КонецПопытки;
					
					
				ИначеЕсли  ЭтоСправочник(ТекНайденныйОбъект.Метаданные) тогда
					
					Попытка 
						Запись = ТекНайденныйОбъект.Данные.ПолучитьОбъект();
						ПроверитьИЗаполнитьРеквизиты(ТекНайденныйОбъект.Метаданные.Реквизиты, Запись, ИскомыйОбъект, ОбъектНаЗамену);
						Для Каждого ТабЧасть из ТекНайденныйОбъект.Метаданные.ТабличныеЧасти цикл
							ПроверитьИЗаполнитьРеквизитыТЧ(ТабЧасть, Запись, ИскомыйОбъект, ОбъектНаЗамену);
						КонецЦикла;
						Запись.Записать();
						
					Исключение
						//Сообщить(ОписаниеОшибки());
					КонецПопытки;
					
				КонецЕсли;
			КонецЦикла;
			//Если надо помечаем на удаление объекты
			Если ПомечатьНаУдаление Тогда
				Для Каждого ОбъектСсылка ИЗ МассивИскомыхСсылок Цикл
					Если Не(ОбъектСсылка.ПометкаУдаления)Тогда
						Попытка
							ТекОбъект  = ОбъектСсылка.ПолучитьОбъект();
							ТекОбъект.ПометкаУдаления = Истина;
							ТекОбъект.Записать();
						Исключение
						КонецПопытки;
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;	
	Возврат Ответ;
	
Конецфункции

//Находит  изменяет все ссылки в реквизитах на ИскомыйОбъект в объекте запись на ОбъектНаЗамену ,КоллекцияРекв - метаданные записи
Процедура ПроверитьИЗаполнитьРеквизиты(КоллекцияРекв, Запись, ИскомыйОбъект, ОбъектНаЗамену)
	
	Для Каждого Реквизит Из КоллекцияРекв Цикл
		
		Если ТипЗнч(ИскомыйОбъект) = Тип("Массив") Тогда
			Для Каждого ИскОб из ИскомыйОбъект Цикл
				
				Если Реквизит.Тип.СодержитТип( типЗнч(ИскОб))Тогда
					Если Запись[Реквизит.Имя] = ИскОб Тогда
						Если Не(ОбъектНаЗамену = Неопределено) Тогда 
							Если Реквизит.Тип.СодержитТип( типЗнч(ОбъектНаЗамену.Ссылка))Тогда
								//Реквизит.Тип.привестиЗначение(ОбъектНаЗамену.Ссылка)
								//Запись[Реквизит.Имя] = ОбъектНаЗамену.Ссылка;
								Запись[Реквизит.Имя] = Реквизит.Тип.ПривестиЗначение(ОбъектНаЗамену.Ссылка);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;				
			КонецЦикла;			
		Иначе
			Если Реквизит.Тип.СодержитТип(типЗнч(ИскомыйОбъект))Тогда
				Если Запись[Реквизит.Имя] = ИскомыйОбъект Тогда
					Если Не(ОбъектНаЗамену = Неопределено) Тогда 
						Если Реквизит.Тип.СодержитТип( типЗнч(ОбъектНаЗамену.Ссылка))Тогда
							Запись[Реквизит.Имя] = Реквизит.Тип.ПривестиЗначение(ОбъектНаЗамену.Ссылка);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьИЗаполнитьВладельца(Запись, ИскомыйОбъект, ОбъектНаЗамену)
		
	Если Запись.Владелец = ИскомыйОбъект Тогда
		Запись.Владелец = ОбъектНаЗамену;
	КонецЕсли;
	
КонецПроцедуры

//Находит  изменяет все ссылки в реквизитах Табличной части на ИскомыйОбъект в объекте запись на ОбъектНаЗамену ,
//МетаТЧ - метаданные табличной части
Процедура ПроверитьИЗаполнитьРеквизитыТЧ(МетаТЧ, Запись, ИскомыйОбъект, ОбъектНаЗамену)
	
	Для Каждого СтрТЧ из Запись[МетаТЧ.Имя] Цикл
		ПроверитьИЗаполнитьРеквизиты(МетаТЧ.Реквизиты, СтрТЧ, ИскомыйОбъект, ОбъектНаЗамену);
	КонецЦикла;
	
КонецПроцедуры

//Получает запись регистра по ключу записи
Функция ПолучитьЗаписьИзРегистра(ДанныеПоРегистру, КлючЗаписи, Запись)
	
	Ответ = Ложь;
	Если ЗначениеЗаполнено(КлючЗаписи) И (Не КлючЗаписи.Пустой()) Тогда
		Если ПроверитьРегистрНаНезависимость(ДанныеПоРегистру) Тогда
			Запись = РегистрыСведений[ДанныеПоРегистру.Имя].СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, КлючЗаписи);
			Попытка
				Запись.Прочитать();
				Ответ = Истина;
			Исключение
				Запись = Неопределено;
				Ответ = Ложь;
			КонецПопытки;
			
		КонецЕсли;
	КонецЕсли;
	Возврат Ответ;
	
КонецФункции

//Проверяет регистр является ли он Независимым
Функция ПроверитьРегистрНаНезависимость(МетДанные)
	
	Ответ = Ложь;
	Попытка
		Если (МетДанные.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.Независимый) Тогда
			Ответ = Истина;
		КонецЕсли;
	Исключение
		Ответ = Ложь;
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	Возврат Ответ;
	
КонецФункции

//Ищет и заменяет всех клиентов с одинаковыми номерами(или емаилами)
Процедура ПоискИЗаменаИдентичныхКлиентов (КлиентНаПроверку = Неопределено, Телефон="", ЕМаил="")  экспорт
	Запрос = Новый Запрос;
	МассивСсылок = Новый Массив();
	//если КлиентНАПроверку заполнен исключаем его из выбора в запросе
	Если (КлиентНаПроверку = Неопределено) Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Объект
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Тип = &Тип
		|	И КонтактнаяИнформация.Представление ПОДОБНО &Представление";
	Иначе
		Запрос.УстановитьПараметр("Ссылка", КлиентНаПроверку.Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Объект
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект <> &Ссылка
		|	И КонтактнаяИнформация.Тип = &Тип
		|	И КонтактнаяИнформация.Представление ПОДОБНО &Представление";
		
		
	КонецЕсли;
	//Заполняем необходимым образом параметры запроса и выполняем заполнения массива ссылок результатами выполнения запроса
	Если ЗначениеЗаполнено(Телефон) Тогда
		Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
		Запрос.УстановитьПараметр("Представление", Телефон);
		
		Выгрузка = Запрос.Выполнить().Выгрузить();
		Для Каждого Запись  ИЗ выгрузка Цикл
			Если  ДобавлятьСсылкуНаКлиента(КлиентНаПроверку,Запись.Объект) тогда
				МассивСсылок.Добавить(Запись.Объект);
			конецесли;
			
		конеццикла;
	КонецЕсли;
	Если ЗначениеЗаполнено(ЕМаил) Тогда
		Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		Запрос.УстановитьПараметр("Представление", ЕМаил);
		
		Выгрузка = Запрос.Выполнить().Выгрузить();
		Для Каждого Запись  ИЗ выгрузка Цикл
			Если  ДобавлятьСсылкуНаКлиента(КлиентНаПроверку,Запись.Объект) Тогда
				МассивСсылок.Добавить(Запись.Объект);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	Удалить = Неопределено;
	ЗаменитьНа  = Неопределено;
	ПеребратьСсылки(КлиентНаПроверку,МассивСсылок,Удалить,ЗаменитьНа);
	Если НЕ( ЗаменитьНа = Неопределено) Тогда
		Для Каждого Найденные ИЗ Удалить Цикл
			ЗаполнитьНедостающиеРеквизиты(ЗаменитьНа,Найденные);
		КонецЦикла;
		
		ИскомыйОбъектСуществует(Удалить,ЗаменитьНа,Ложь);			
	КонецЕсли;
	
КонецПроцедуры

//Нужно ли заменять основного клиента из всех
Функция ДобавлятьСсылкуНаКлиента(КлиентПроверка,Запись)
	Ответ = Ложь;
	Если ТипЗнч( КлиентПроверка)=Тип("СправочникСсылка.Контрагенты") Тогда
		Если ТипЗнч(Запись) = Тип("СправочникСсылка.Контрагенты")  тогда
			Ответ = Истина;
		КонецЕсли;
		
	Иначе
		Ответ = Истина;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

//Перебрать все ссылки и выбрать главного клиента из всех найденных с одинаковой контактной информацией
Процедура ПеребратьСсылки(Проверка,МасСсылок,ОбъектыКУдалению,ОсновнойКлиент )
	Если Проверка = Неопределено Тогда 
		ОсновнойКлиент = Неопределено;
		ОбъектыКУдалению = Новый массив;
		Если МасСсылок.Количество()> 0 Тогда
			ТекКлиент = МасСсылок[0];
			Для Каждого Ссылк ИЗ МасСсылок Цикл
				Если НЕ (ТекКлиент = Ссылк) Тогда
					Если  (НЕ (ТипЗнч(ТекКлиент)=Тип("СправочникСсылка.Контрагенты"))) И (ТипЗнч(Ссылк)=Тип("СправочникСсылка.Контрагенты")) Тогда
						ОбъектыКУдалению.Добавить(ТекКлиент);
						ТекКлиент = Ссылк;
					Иначе
						ОбъектыКУдалению.Добавить(Ссылк);
						
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;	
			ОсновнойКлиент = ТекКлиент;
		КонецЕсли;
	Иначе
		ОбъектыКУдалению = Новый массив;
		Если МасСсылок.Количество()> 0 Тогда
			Для Каждого Ссылк ИЗ МасСсылок Цикл
				Если НЕ (Проверка = Ссылк) Тогда
					Если  (НЕ (ТипЗнч(Проверка)=Тип("СправочникСсылка.Контрагенты"))) И (ТипЗнч(Ссылк)=Тип("СправочникСсылка.Контрагенты")) Тогда
						//ОбъектыКУдалению.Добавить(Ссылк);
						Проверка = Ссылк;
					Иначе
						ОбъектыКУдалению.Добавить(Ссылк);
						
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;	
			ОсновнойКлиент = Проверка;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//Заполнить незаполненые реквизиты в объекте  из Удаляемогообъекта если надо по структуре сопастовления реквизитво между объектами
Процедура ЗаполнитьНедостающиеРеквизиты(Объект, УдаляемыйОбъект, СтруктураСопоставления = Неопределено, СохранятьОбъект = Истина) Экспорт
	
	МетОбъекта = Объект.Метаданные();
	МетУдаляемогоОбъекта = УдаляемыйОбъект.Метаданные();
	МассивРеквизитов = Новый Массив();
	ИскатьСоответсвия = Ложь;
	БылИзменен = Ложь;
	
	Если НЕ (СтруктураСопоставления = неопределено) Тогда
		////Если МассивСопоставления.Количество()> 0 Тогда
		ИскатьСоответсвия = Истина;
		//КонецЕсли;
	КонецЕсли;
	
	Для Каждого Реквизит ИЗ МетОбъекта.Реквизиты Цикл
		Если НЕ ЗначениеЗаполнено(Объект[Реквизит.Имя]) Тогда
			МассивРеквизитов.Добавить(Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Реквизит ИЗ МассивРеквизитов Цикл
		ИскомоеИмя = Реквизит;
		Если ИскатьСоответсвия Тогда
			Соответствие = "";
			Если СтруктураСопоставления.Свойство(Реквизит, Соответствие) = Истина Тогда
				ИскомоеИмя = Соответствие;
			КонецЕсли;
			
		КонецЕсли;
		Если НЕ(МетУдаляемогоОбъекта.Реквизиты.Найти(ИскомоеИмя) = Неопределено) Тогда
			Если ЗначениеЗаполнено(УдаляемыйОбъект[ИскомоеИмя])Тогда
				Объект[Реквизит] = УдаляемыйОбъект[ИскомоеИмя];
				БылИзменен = Истина;
			КонецЕсли;
			
		КонецЕсли;		
	КонецЦикла;
	
	Если ТипЗнч(Объект) = Тип("СправочникОбъект.Контрагенты") Тогда
		Если Не ЗначениеЗаполнено(Объект.ВидКонтрагента) Тогда
			Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.СогласиеНаОбработкуПерсональныхДанных) Тогда
			Объект.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Спрашивать;
		КонецЕсли;
	КонецЕсли;
	
	Если БылИзменен и СохранятьОбъект Тогда
		Объект.УстановитьНовыйКод();
		Объект.Записать();
	КонецЕсли;
	
КонецПроцедуры

//функции проверки ан пренадлежность метаданным
Функция ЭтоДокумент(Метадан = Неопределено, Объект = Неопределено) Экспорт
	
	Ответ = Ложь;
	МетОб = Неопределено;
	Продолжать = Истина;
	Если НЕ( Метадан = Неопределено)  Тогда
		МетОб = Метадан;
	ИначеЕсли НЕ(Объект = Неопределено) Тогда
		МетОб = Метаданные.НайтиПоТипу(ТипЗнч(Объект));
	КонецЕсли;
	Если Продолжать Тогда
		Если Метаданные.Документы.Содержит(МетОб)Тогда
			Ответ = Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Ответ;
	
КонецФункции

Функция ЭтоСправочник(Метадан = Неопределено, Объект = Неопределено) Экспорт
	
	Ответ = Ложь;
	МетОб = Неопределено;
	Продолжать = Истина;
	Если НЕ(Метадан = Неопределено)  Тогда
		МетОб = Метадан;
	ИначеЕсли НЕ(Объект = Неопределено) Тогда
		МетОб = Метаданные.НайтиПоТипу(ТипЗнч(Объект));
	КонецЕсли;
	Если Продолжать Тогда
		Если Метаданные.Справочники.Содержит(МетОб)Тогда
			Ответ = Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Ответ;
	
КонецФункции

Функция ЭтоРегистрСведений(Метадан = Неопределено, Объект = Неопределено)Экспорт 
	
	Ответ = Ложь;
	МетОб = Неопределено;
	Продолжать = Истина;
	Если НЕ(Метадан = Неопределено)  Тогда
		МетОб = Метадан;
	ИначеЕсли НЕ(Объект = Неопределено) Тогда
		МетОб = Метаданные.НайтиПоТипу(ТипЗнч(Объект));
	КонецЕсли;
	Если Продолжать Тогда
		Если Метаданные.РегистрыСведений.Содержит(МетОб)Тогда
			Ответ = Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Ответ;
	
КонецФункции
//конец функций принадлежности  кгруппам метаданных

//ищет существует ли номер и у кого он существует возврашается в КлиентыДубликаты
Функция НомерСуществует(Номер, КлиентыДубликаты, КлиентыИсключения = Неопределено) Экспорт
	// pu02028 #ИЗМ000001
	
	Если Номер = "" Тогда
		Возврат Ложь;
	КонецЕсли;
	Ответ = Ложь;
	КлиентыДубликаты = Новый Массив();
	
	Запрос = Новый Запрос();
	ТекстЗапроса = "";
	Если КлиентыИсключения = неопределено Тогда
		ТекстЗапроса ="ВЫБРАТЬ
		|	КонтактнаяИнформация.Объект,
		|	КонтактнаяИнформация.Представление КАК Телефон
		|ПОМЕСТИТЬ Вт
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Тип = &Тип
		|	И КонтактнаяИнформация.Представление ПОДОБНО &Телефон";
	Иначе
		Если ТипЗнч(КлиентыИсключения) = Тип("Массив") Тогда
			ТекстЗапроса ="ВЫБРАТЬ
			|	КонтактнаяИнформация.Объект,
			|	КонтактнаяИнформация.Представление КАК Телефон
			|ПОМЕСТИТЬ Вт
			|ИЗ
			|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
			|ГДЕ
			|	КонтактнаяИнформация.Тип = &Тип
			|	И КонтактнаяИнформация.Представление ПОДОБНО &Телефон
			|	И НЕ (КонтактнаяИнформация.Объект В(&Объект))";
			
		иначе
			ТекстЗапроса ="ВЫБРАТЬ
			              |	КонтактнаяИнформация.Объект,
			              |	КонтактнаяИнформация.Представление КАК Телефон
			              |ПОМЕСТИТЬ Вт
			              |ИЗ
			              |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
			              |ГДЕ
			              |	КонтактнаяИнформация.Тип = &Тип
			              |	И ВЫБОР
			              |			КОГДА КонтактнаяИнформация.Поле1 <> """"
			              |					И КонтактнаяИнформация.Поле2 <> """"
			              |					И КонтактнаяИнформация.Поле3 <> """"
			              |				ТОГДА КонтактнаяИнформация.Поле1 + КонтактнаяИнформация.Поле2 + КонтактнаяИнформация.Поле3 ПОДОБНО &Телефон
			              |			ИНАЧЕ КонтактнаяИнформация.Представление ПОДОБНО &Телефон
			              |		КОНЕЦ
			              |	И НЕ КонтактнаяИнформация.Объект = &Объект";
		КонецЕсли;
		Запрос.УстановитьПараметр("Объект", КлиентыИсключения);
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса +
	";
	|
	|ВЫБРАТЬ
	|	Вт.Объект,
	|	Вт.Телефон,
	|	EMail.Представление КАК EMail,
	|	ВЫБОР КОГДА Вт.Объект ССЫЛКА Справочник.Контрагенты ТОГДА
	|		Контрагенты.ДатаРегистрации ИНАЧЕ CRM_КлиентскиеДанные.ДатаСоздания КОНЕЦ КАК ДатаСоздания
	|ИЗ Вт КАК Вт
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.КонтактнаяИнформация КАК EMail
	|	ПО EMail.Объект = Вт.Объект
	|	И EMail.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И EMail.ЗначениеПоУмолчанию = Истина
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.CRM_КлиентскиеДанные КАК CRM_КлиентскиеДанные
	|ПО
	|	CRM_КлиентскиеДанные.Клиент = Вт.Объект
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|ПО Контрагенты.Ссылка = Вт.Объект
	|УПОРЯДОЧИТЬ ПО
	|	ПОДСТРОКА(Вт.Телефон, 1, 30)";
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Телефон", "%" + Номер + "%");
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Ответ =  Ложь;
	Иначе
		Ответ =  Истина;
		Выгрузка = Результат.Выгрузить();
		Для Каждого ТекВыгрузка ИЗ Выгрузка Цикл
			Струк = Новый Структура();
			Струк.Вставить("Ссылка", ТекВыгрузка.Объект);
			Струк.Вставить("Телефон", ТекВыгрузка.Телефон);
			Струк.Вставить("EMail", ТекВыгрузка.EMail);
			Струк.Вставить("ДатаСоздания", ТекВыгрузка.ДатаСоздания);
			КлиентыДубликаты.Добавить(Струк);
		КонецЦикла;
		
	КонецЕсли;
	Возврат Ответ;
	
КонецФункции

//ищет существует ли ФИО и у кого он существует возврашается в КлиентыДубликаты
Функция ФИОСуществует(ФИОПоиска, КлиентыДубликаты, КлиентыИсключения = Неопределено) Экспорт
	// pu02028 #ИЗМ000001
	
	Если ФИОПоиска = "" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Ответ = Ложь;
	КлиентыДубликаты = Новый Массив();
	Запрос = Новый Запрос();
	ТекстЗапроса = "";
	Если КлиентыИсключения = неопределено Тогда
		ТекстЗапроса ="ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ПОМЕСТИТЬ Врем
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Наименование ПОДОБНО &ФИО";
	Иначе
		Если ТипЗнч(КлиентыИсключения) = Тип("Массив") Тогда
			ТекстЗапроса ="ВЫБРАТЬ
			|	Контрагенты.Ссылка
			|ПОМЕСТИТЬ Врем
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	НЕ (Контрагенты.Ссылка В(&Объект))
			|	И Контрагенты.Наименование ПОДОБНО &ФИО";
			
		иначе
			ТекстЗапроса ="ВЫБРАТЬ
			|	Контрагенты.Ссылка
			|ПОМЕСТИТЬ Врем
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	НЕ Контрагенты.Ссылка = &Объект
			|	И Контрагенты.Наименование ПОДОБНО &ФИО";
		КонецЕсли;
		Запрос.УстановитьПараметр("Объект", КлиентыИсключения);
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса + Символы.ПС + 
	";
	|
	|ВЫБРАТЬ
	|	ВремТЗ.Ссылка,
	|	КонтактнаяИнформация.Представление КАК Телефон,
	|	EMail.Представление КАК EMail,
	|	ВЫБОР КОГДА ВремТЗ.Ссылка ССЫЛКА Справочник.Контрагенты ТОГДА
	|		Контрагенты.ДатаРегистрации ИНАЧЕ CRM_КлиентскиеДанные.ДатаСоздания КОНЕЦ КАК ДатаСоздания
	|ИЗ Врем КАК ВремТЗ
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|	ПО КонтактнаяИнформация.Объект = ВремТЗ.Ссылка
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И КонтактнаяИнформация.ЗначениеПоУмолчанию = Истина
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.КонтактнаяИнформация КАК EMail
	|	ПО EMail.Объект = ВремТЗ.Ссылка
	|	И EMail.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И EMail.ЗначениеПоУмолчанию = Истина
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.CRM_КлиентскиеДанные КАК CRM_КлиентскиеДанные
	|ПО
	|	CRM_КлиентскиеДанные.Клиент = ВремТЗ.Ссылка
	|СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|ПО Контрагенты.Ссылка = ВремТЗ.Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	ВремТЗ.Ссылка";
	Запрос.УстановитьПараметр("ФИО", "%" + ФИОПоиска + "%");
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Ответ =  Ложь;
	Иначе
		Ответ =  Истина;
		Выгрузка = Результат.Выгрузить();
		Для Каждого ТекВыгрузка ИЗ Выгрузка Цикл
			Струк = Новый Структура();
			Струк.Вставить("Ссылка", ТекВыгрузка.Ссылка);
			Струк.Вставить("Телефон", ТекВыгрузка.Телефон);
			Струк.Вставить("EMail", ТекВыгрузка.EMail);
			Струк.Вставить("ДатаСоздания", ТекВыгрузка.ДатаСоздания);
			КлиентыДубликаты.Добавить(Струк);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция EMailСуществует(EMail, КлиентыДубликаты, КлиентИсключение) Экспорт
	// pu02028 #ИЗМ000001
	
	Если EMail = "" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Объект,
		|	КонтактнаяИнформация.Представление КАК EMail,
		|	Телефон.Представление КАК Телефон,
		|	ВЫБОР
		|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
		|			ТОГДА Контрагенты.ДатаРегистрации
		|		ИНАЧЕ CRM_КлиентскиеДанные.ДатаСоздания
		|	КОНЕЦ КАК ДатаСоздания
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК Телефон
		|		ПО (Телефон.Объект = КонтактнаяИнформация.Объект)
		|			И (Телефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
		|			И (Телефон.ЗначениеПоУмолчанию = ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_КлиентскиеДанные КАК CRM_КлиентскиеДанные
		|		ПО (CRM_КлиентскиеДанные.Клиент = КонтактнаяИнформация.Объект)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО (Контрагенты.Ссылка = КонтактнаяИнформация.Объект)
		|ГДЕ
		|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
		|	И КонтактнаяИнформация.Представление ПОДОБНО &EMail
		|	И НЕ КонтактнаяИнформация.Объект = &Объект
		|	И КонтактнаяИнформация.ЗначениеПоУмолчанию = Истина
		|
		|УПОРЯДОЧИТЬ ПО
		|	КонтактнаяИнформация.Объект";
	Запрос.УстановитьПараметр("Объект", КлиентИсключение);
	Запрос.УстановитьПараметр("EMail", EMail);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КлиентыДубликаты = Новый Массив();
	Выгрузка = Результат.Выгрузить();
	Для Каждого ТекВыгрузка ИЗ Выгрузка Цикл
		Струк = Новый Структура();
		Струк.Вставить("Ссылка", ТекВыгрузка.Объект);
		Струк.Вставить("Телефон", ТекВыгрузка.Телефон);
		Струк.Вставить("EMail", ТекВыгрузка.EMail);
		Струк.Вставить("ДатаСоздания", ТекВыгрузка.ДатаСоздания);
		КлиентыДубликаты.Добавить(Струк);
	КонецЦикла;
		
	Возврат Истина;
	
КонецФункции

//Открыть форму дедубликации клиента, обработать и вернуть результат отработки формы
Функция ВопросЗаменятьКлиента(ГлавныйКлиент, МассивДублей) Экспорт
	
	#Если Клиент Тогда
	
		Результат = КодВозвратаДиалога.Нет;
		
	#Иначе
		
		Результат = Неопределено;
		
	#КонецЕсли
	
	#Если наКлиенте Тогда
		Форм = ПолучитьОбщуюФорму("CRM_ФормаДедубликацииКлиента");
		Форм.МассивДублей = МассивДублей;
		Результат = Форм.ОткрытьМодально();
		Если Результат = неопределено тогда
			Результат = КодВозвратаДиалога.Нет;
		ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
			// pu02028 #ИЗМ000001
			ГлавныйКлиент.Ссылка = Форм.ЭлементыФормы.Клиенты.ВыделенныеСтроки[0].Клиент;
			ГлавныйКлиент.Телефон = Форм.ЭлементыФормы.Клиенты.ВыделенныеСтроки[0].Телефон;
			ГлавныйКлиент.EMail = Форм.ЭлементыФормы.Клиенты.ВыделенныеСтроки[0].EMail;
			//~ pu02028 #ИЗМ000001
			
		КонецЕсли;
		
	#КонецЕсли
	Возврат Результат;
	
КонецФункции

//Заменяем одного клиента на другого если нужно в контретном  объекте
Процедура ЗаменитьКлиентаНаКлиента(КлиентУдаляемый, Клиент, ОбъектыДляЗамены = Неопределено, ПомечатьНаУдаление = Истина)  Экспорт
	
	Попытка
		
		//КлиентОбъект = Клиент;
		ЗаполнитьНедостающиеРеквизиты(Клиент, КлиентУдаляемый);
		//Клиент = КлиентОбъект.Ссылка;
		//Если заменяем везде 
		Если ОбъектыДляЗамены = Неопределено Тогда
			ИскомыйОбъектСуществует(КлиентУдаляемый, Клиент, Ложь, ПомечатьНаУдаление);
		//Иначе только в списке объектов
		Иначе
			Для Каждого Ссылка ИЗ ОбъектыДляЗамены Цикл
				Если  ЭтоДокумент(Ссылка) Тогда
					Попытка 
						Запись = Ссылка.ПолучитьОбъект();
						ПроверитьИЗаполнитьРеквизиты(Запись.Метаданные().Реквизиты, Запись, КлиентУдаляемый, Клиент);
						Для Каждого ТабЧасть из Запись.Метаданные().ТабличныеЧасти цикл
							ПроверитьИЗаполнитьРеквизитыТЧ(ТабЧасть,Запись, КлиентУдаляемый, Клиент);
						КонецЦикла;
						Если Запись.Проведен Тогда
							Попытка
								Запись.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
							Исключение
								Запись.Записать(РежимЗаписиДокумента.Запись);
							КонецПопытки;
						Иначе
							Запись.Записать(РежимЗаписиДокумента.Запись);
						КонецЕсли;
						
					Исключение
						//Сообщить(ОписаниеОшибки());
					КонецПопытки;
				ИначеЕсли  ЭтоСправочник(Ссылка) тогда
					
					Попытка 
						Запись = Ссылка.ПолучитьОбъект();
						ПроверитьИЗаполнитьРеквизиты(Запись.Метаданные().Реквизиты, Запись, КлиентУдаляемый, Клиент);
						Для Каждого ТабЧасть из Запись.Метаданные().ТабличныеЧасти цикл
							ПроверитьИЗаполнитьРеквизитыТЧ(ТабЧасть, Запись, КлиентУдаляемый, Клиент);
						КонецЦикла;
						Запись.Записать();
						
					Исключение
						//Сообщить(ОписаниеОшибки());
					КонецПопытки;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
	Исключение
		
	КонецПопытки;
КонецПроцедуры

//Проверка существования рабочего листа с задданым идк
Функция РлСуществует(РЛДубликаты, IDK, Клиент =  Неопределено, Телефон = "") Экспорт
	
	Ответ = Ложь;
	РЛДубликаты = Новый Массив();
	Попытка
		Если Не(Клиент = Неопределено) Тогда
			Запрос = Новый Запрос();
			ТекстЗапроса = "";
			ТекстЗапроса ="ВЫБРАТЬ РАЗЛИЧНЫЕ
			              |	Renault_РабочиеЛисты.IDK КАК НомерРЛ,
			              |	Renault_РабочиеЛисты.Клиент КАК Наименование,
			              |	Renault_РабочиеЛисты.Сотрудник КАК Менеджер,
			              |	Renault_РабочиеЛисты.ДатаID КАК ДатаСоздания,
			              |	&Телефон
			              |ИЗ
			              |	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
			              |ГДЕ
			              |	Renault_РабочиеЛисты.IDK <> &Идк
			              |	И Renault_РабочиеЛисты.Клиент = &Клиент
			              |	И Renault_РабочиеЛисты.ЛистЗакрыт = ЛОЖЬ";
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("Клиент",Клиент);
			Запрос.УстановитьПараметр("Период",ТекущаяДата());
            Запрос.УстановитьПараметр("Телефон",Телефон);
            Запрос.УстановитьПараметр("Идк", IDK);
			
			Результат = Запрос.Выполнить();
			Если Результат.Пустой() Тогда
				Ответ =  Ложь;
			Иначе
				Ответ =  Истина;
				Выгрузка = Результат.Выгрузить();
				Для Каждого ТекВыгрузка ИЗ Выгрузка Цикл
					Если РЛДубликаты.Найти(ТекВыгрузка) = Неопределено Тогда
						РЛДубликаты.Добавить(ТекВыгрузка);
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
		КонецЕсли;
				
	Исключение
		Опис = ОписаниеОшибки();
		Ответ = ложь;
	КонецПопытки;
	Возврат Ответ;
	
КонецФункции

 //аналагично замене клиента на клиента только для массива клиентов(КлиентыУдаляемые)
 Процедура ЗаменитьКлиентовНаКлиента(КлиентыУдаляемые, Клиент, ПомечатьНаУдаление = Истина) Экспорт
	 
	 Попытка
		
		КлиентОбъект = Клиент.ПолучитьОбъект();
		Для Каждого КлиентУд из КлиентыУдаляемые Цикл
			ЗаполнитьНедостающиеРеквизиты(КлиентОбъект, КлиентУд);
		КонецЦикла;
				
		ИскомыйОбъектСуществует(КлиентыУдаляемые, Клиент, Ложь, ПомечатьНаУдаление);
		
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры

Функция ДатаСозданияКлиента(Ссылка) Экспорт
	
	// pu02028 #ЧАС000002
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат Ссылка.ДатаРегистрации;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	CRM_КлиентскиеДанные.ДатаСоздания
			|ИЗ
			|	РегистрСведений.CRM_КлиентскиеДанные КАК CRM_КлиентскиеДанные
			|ГДЕ
			|	CRM_КлиентскиеДанные.Клиент = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда 
			Возврат Дата(1, 1, 1); 
		КонецЕсли;
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.ДатаСоздания;
	КонецЕсли;
	//~ pu02028 #ЧАС000002
	
КонецФункции

// Игорь Морозов 20.07.2018
Функция РазобратьНаименованиеПоФИО(НаименованиеКлиента) Экспорт
	
	ПромНаименование = НаименованиеКлиента;
	Рез = Новый Структура("Фамилия,Имя,Отчество","","","");
	Для Сч = 1 по 3 цикл
		НомерПробела = СтрНайти(ПромНаименование," ");
		Если НомерПробела = 0 тогда
			Если Сч = 1 тогда
				Рез.Фамилия = ПромНаименование;				
			ИначеЕсли Сч = 2 тогда
				Рез.Имя = ПромНаименование;				
			ИначеЕсли Сч = 3 тогда
				Рез.Отчество = ПромНаименование;				
			Иначе
				Возврат Рез;
			КонецЕСли;	
			Возврат Рез;
		Иначе
			Если Сч = 1 тогда
				Рез.Фамилия = Сред(ПромНаименование,1,НомерПробела-1);
			ИначеЕсли Сч = 2 тогда
				Рез.Имя = Сред(ПромНаименование,1,НомерПробела-1);
			ИначеЕсли Сч = 3 тогда
				Рез.Отчество = Сред(ПромНаименование,1,НомерПробела-1);
			КонецЕСли;	
			ПромНаименование = Сред(ПромНаименование,НомерПробела+1);
		КонецЕсли;	
	КонецЦикла;	
	Возврат Рез;	
КонецФункции	
// Игорь Морозов 20.07.2018>>

Функция СоздатьКонтрагентаНаОснованииПотенциальногоКлиента(Клиент, Договор = Неопределено) Экспорт
	
	ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
	Если ЗначениеЗаполнено(ДилерскийЦентр) Тогда
		КаталогСозданияКонтрагентов = ДилерскийЦентр.КаталогСозданияКонтрагентов;
	Иначе
		КаталогСозданияКонтрагентов = Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Клиент) = Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат Клиент;
	КонецЕсли;
	
	Контрагент = Справочники.Контрагенты.СоздатьЭлемент();
	
	ЗаполнитьЗначенияСвойств(Контрагент, Клиент,, "Владелец, Родитель, Код"); 
	Контрагент.СогласиеНаПолучениеSMS = Клиент.СогласенНаКоммуникацию;
	// Игорь Морозов 20.07.2018
	//ЗаполнитьЗначенияСвойств(Контрагент, Клиент,"Фамилия, Имя ,Отчество"); 
	
	Если Не ЗначениеЗаполнено(Контрагент.Фамилия) и 
		Не ЗначениеЗаполнено(Контрагент.Имя) и 
		Не ЗначениеЗаполнено(Контрагент.Отчество) тогда
		ФИОКонтрагента = РазобратьНаименованиеПоФИО(Клиент.Наименование);
		ЗаполнитьЗначенияСвойств(Контрагент,ФИОКонтрагента);
	КонецЕсли;
	// Игорь Морозов 20.07.2018>>
	
	
	
	Контрагент.Родитель = КаталогСозданияКонтрагентов;
	
	//Дозаполним обязательные поля, если они не заполнены
	Контрагент.УстановитьНовыйКод();	
	
	Если Не ЗначениеЗаполнено(Контрагент.ВидКонтрагента) Тогда
		Контрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Контрагент.СогласиеНаОбработкуПерсональныхДанных) Тогда
		Контрагент.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Спрашивать;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(Контрагент.ФормаСобственности) Тогда
		Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо;
	КонецЕсли;
	
	//поиск телефона клиента и перенос его в основной телефон контрагента
	Контрагент.ОсновнойТелефон = "_";
	Набор = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	Набор.Отбор.Объект.Установить(Клиент);
	Набор.Прочитать();
	ТЗ = Набор.Выгрузить();
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		Если СтрокаТЗ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			Контрагент.ОсновнойТелефон = СтрокаТЗ.Представление;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Контрагент.Записать();
	
	КлиентОб = Клиент.ПолучитьОбъект();
	КлиентОб.Контрагент = Контрагент.Ссылка;
	КлиентОб.Записать();
	
	//Если Договор <> Неопределено Тогда
	//	СоздатьДоговорКонтрагентаПокупателя(Контрагент.Ссылка,Договор);
	//КонецЕсли;
	
	// Переносим контактную информацию потенциального клиента
	Набор = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	Набор.Отбор.Объект.Установить(Клиент);
	Набор.Прочитать();
	ТЗ = Набор.Выгрузить();
	
	Набор.Отбор.Объект.Установить(Контрагент.Ссылка);
	Набор.Загрузить(ТЗ);
	Для Каждого Строка Из Набор Цикл
		Строка.Объект = Контрагент.Ссылка;
	КонецЦикла;
	Набор.Записать();
	
	//Изменим клиента в рабочем листе
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_РабочиеЛисты.Ссылка
	               |ИЗ
	               |	Документ.Renault_РабочийЛист КАК Renault_РабочиеЛисты
	               |ГДЕ
	               |	Renault_РабочиеЛисты.Клиент = &Клиент";
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписьРЛ = Выборка.Ссылка.ПолучитьОбъект();
		Если ЗаписьРЛ <> Неопределено Тогда
			ЗаписьРЛ.Клиент = Контрагент.Ссылка;
			ЗаписьРЛ.Записать();
		КонецЕсли;
	КонецЦикла;

	//Изменим клиента в трафике
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_Трафик.Идентификатор
	               |ИЗ
	               |	РегистрСведений.Renault_Трафик КАК Renault_Трафик
	               |ГДЕ
	               |	Renault_Трафик.Клиент = &Клиент";
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписьТрафик = Renault_CRM.ПолучитьЗаписьТрафикаПоID(Выборка.Идентификатор);
		Если ЗаписьТрафик <> Неопределено Тогда
			ЗаписьТрафик.Клиент = Контрагент.Ссылка;
			ЗаписьТрафик.Записать();
		КонецЕсли;
	КонецЦикла;
	
	//Козлов Е.А. Начало 10.11.2016
	//Переносим данные подтверждающих документов 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодтверждающиеДокументы.Ссылка
		|ИЗ
		|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
		|ГДЕ
		|	ПодтверждающиеДокументы.Владелец = &Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодтверждающиеДокументы.Ссылка
		|ИЗ
		|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
		|ГДЕ
		|	ПодтверждающиеДокументы.Владелец = &ПотенциальныйКонтрагент
		|	И НЕ ПодтверждающиеДокументы.ПометкаУдаления"; 	
	Запрос.УстановитьПараметр("ПотенциальныйКонтрагент", Клиент);
	Запрос.УстановитьПараметр("Контрагент", Контрагент.Ссылка);	

	Результат = Запрос.ВыполнитьПакет();
	
	Если Результат[0].Пустой() Тогда
		Если НЕ Результат[1].Пустой() Тогда
			Выборка = Результат[1].Выбрать();

			Пока Выборка.Следующий() Цикл
				НовыйПодтДок = Выборка.Ссылка.Скопировать();
				НовыйПодтДок.Владелец = Контрагент.Ссылка;
				Если НЕ ЗначениеЗаполнено(НовыйПодтДок.Организация) Тогда
					НовыйПодтДок.Организация = ПараметрыСеанса.Организация;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(НовыйПодтДок.ВалютаДокумента) Тогда
					НовыйПодтДок.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(); 
				КонецЕсли;
				НовыйПодтДок.Номер = Выборка.Ссылка.Номер;
				НовыйПодтДок.УстановитьНовыйКод();
				НовыйПодтДок.Записать();
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	//Козлов Е.А. Конец
	
	// Устанавливаем связь потенциального клиента с созданным контрагентом
	КлиентОбъект = Клиент.ПолучитьОбъект();
	КлиентОбъект.Контрагент = Контрагент.Ссылка;
	КлиентОбъект.Записать();
	
	ДокументСогласие = Документы.DMS_СогласиеНаОбработкуПерсональныхДанных.ВернутьСогласиеПоКлиенту(Клиент);
	Если ЗначениеЗаполнено(ДокументСогласие) тогда
		ДокументОбъект = ДокументСогласие.получитьобъект();
		//КлиентОбъект.СогласиеНаПолучениеSMS = ДокументОбъект.
		ДокументОбъект.ФизическоеЛицо = Контрагент.Ссылка;
		ДокументОбъект.Записать();
	КонецЕсли;
	
	
	Возврат Контрагент.Ссылка;
		
КонецФункции

Процедура СоздатьДоговорКонтрагентаПокупателя(КонтрагентСсылка, Договор) Экспорт
	
	ДЦ = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
	Если НЕ(ДЦ = Неопределено) Тогда
		
		//Если ДЦ.ЕдиныйНомерДоговраИДоговораВзаиморасчетов И ЗначениеЗаполнено(Договор.НомерДоговора) Тогда
		//	
		//	 НайтиСоздатьДоговорВзаиморасчетов(КонтрагентСсылка, Договор, Истина);
		//	 
		// Иначе
			 
			 НайтиСоздатьДоговорВзаиморасчетов(КонтрагентСсылка, Договор);
			 
		 //КонецЕсли;
		 
	Иначе
		
		НайтиСоздатьДоговорВзаиморасчетов(КонтрагентСсылка, Договор);
				
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроизвестиЗаменуКлиентов(КлиентЗаменитьКого, КлиентЗаменитьНаКого, ВключитьОбъектыМассив = Неопределено, ИсключитьОбъектыМассив = Неопределено, Отказ = Ложь) Экспорт
	
	ПомечатьНаУдаление = Истина;
	
	Если ЗначениеЗаполнено(ВключитьОбъектыМассив) Тогда
		//Выполним замену только в указанных объектах
		//...
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(ИсключитьОбъектыМассив) Тогда
		ИсключитьОбъектыМассив = Новый Массив;
	КонецЕсли;
		
	ТаблицаСсылокОбъектовДляЗамены = НайтиСсылкиНаОбъект(КлиентЗаменитьКого);
	Если ТаблицаСсылокОбъектовДляЗамены.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	Для Каждого СтрокаСсылкаНаОбъектДляЗамены Из ТаблицаСсылокОбъектовДляЗамены Цикл
		
		Если ЭтоСправочник(СтрокаСсылкаНаОбъектДляЗамены.Метаданные) Тогда
			Если ИсключитьОбъектыМассив.Найти(СтрокаСсылкаНаОбъектДляЗамены.Данные.Ссылка) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ПроизвестиЗаменуСсылкиВОбъекте(КлиентЗаменитьКого, КлиентЗаменитьНаКого, СтрокаСсылкаНаОбъектДляЗамены, Отказ);
		
		// проведем поиск дублей основных контактов у нового клиента
		Если СтрокаСсылкаНаОбъектДляЗамены.Метаданные = Метаданные.РегистрыСведений.КонтактнаяИнформация Тогда
			
			Набор = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
			Набор.Отбор.Объект.Установить(КлиентЗаменитьНаКого);
			Набор.Отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.Телефон);
			Набор.Прочитать();
			Если Набор.Количество() > 1 Тогда
				Первый = Истина;
				Для Каждого Запись ИЗ Набор Цикл
					Если Запись.ЗначениеПоУмолчанию Тогда
						Если НЕ Первый Тогда
							Запись.ЗначениеПоУмолчанию = Ложь;
						КонецЕсли;
						Первый = Ложь;
					КонецЕсли;
				КонецЦикла;
				Набор.Записать();
			КонецЕсли;
			
			Набор = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
			Набор.Отбор.Объект.Установить(КлиентЗаменитьНаКого);
			Набор.Отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
			Набор.Прочитать();
			Если Набор.Количество() > 1 Тогда
				Первый = Истина;
				Для Каждого Запись ИЗ Набор Цикл
					Если Запись.ЗначениеПоУмолчанию Тогда
						Если НЕ Первый Тогда
							Запись.ЗначениеПоУмолчанию = Ложь;
						КонецЕсли;
						Первый = Ложь;
					КонецЕсли;
				КонецЦикла;
				Набор.Записать();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
				
	//Если надо помечаем на удаление объекты, которые заменяли
	Если ПомечатьНаУдаление Тогда
		
		Попытка
			ТекОбъект = КлиентЗаменитьКого.ПолучитьОбъект();
			ТекОбъект.ПометкаУдаления = Истина;
			ТекОбъект.Записать();
		Исключение
			Отказ = Истина;
			Возврат;
		КонецПопытки;
		
	КонецЕсли;	
		
КонецПроцедуры

Функция НайтиСсылкиНаОбъект(СсылкаДляПоиска)
	
	//Приведем к массиву
	Если Не (ТипЗнч(СсылкаДляПоиска) = Тип ("Массив")) Тогда
		МассивИскомыхСсылок = Новый Массив();
		МассивИскомыхСсылок.Добавить(СсылкаДляПоиска);
	КонецЕсли;
	
	//Таблица ссылок на объекты где есть ссылки на искомые объекты
	ТаблицаСсылок = новый Массив;
	Если МассивИскомыхСсылок.Количество() > 0 Тогда
		МассивСсылок = НайтиПоСсылкам(МассивИскомыхСсылок);
	КонецЕсли;
	
	Возврат МассивСсылок;
		
КонецФункции

Процедура ПроизвестиЗаменуСсылкиВОбъекте(СсылкаЗаменитьКого, СсылкаЗаменитьНаКого, СтрокаСсылкаЗаменитьГде, Отказ = Ложь)
	
	Если ЭтоРегистрСведений(СтрокаСсылкаЗаменитьГде.Метаданные) Тогда
		
		Запись = Неопределено;
		УспешноПрочитано = ПолучитьЗаписьИзРегистра(СтрокаСсылкаЗаменитьГде.Метаданные, СтрокаСсылкаЗаменитьГде.Данные, Запись);
		Если УспешноПрочитано тогда
			
			ПроверитьИЗаполнитьРеквизиты(СтрокаСсылкаЗаменитьГде.Метаданные.Ресурсы, Запись, СсылкаЗаменитьКого, СсылкаЗаменитьНаКого);
			ПроверитьИЗаполнитьРеквизиты(СтрокаСсылкаЗаменитьГде.Метаданные.Реквизиты, Запись, СсылкаЗаменитьКого, СсылкаЗаменитьНаКого);
			ПроверитьИЗаполнитьРеквизиты(СтрокаСсылкаЗаменитьГде.Метаданные.Измерения, Запись, СсылкаЗаменитьКого, СсылкаЗаменитьНаКого);
			Попытка 
				Запись.Записать();				
			Исключение
				Отказ = Истина;
				Возврат;
			Конецпопытки;
			
		КонецЕсли;
						
	ИначеЕсли ЭтоДокумент(СтрокаСсылкаЗаменитьГде.Метаданные) Тогда
		
		Попытка
		
			Запись = СтрокаСсылкаЗаменитьГде.Данные.ПолучитьОбъект();
			Запись.ОбменДанными.Загрузка = Истина;
			ПроверитьИЗаполнитьРеквизиты(СтрокаСсылкаЗаменитьГде.Метаданные.Реквизиты, Запись, СсылкаЗаменитьКого, СсылкаЗаменитьНаКого);
			Для Каждого ТабЧасть из СтрокаСсылкаЗаменитьГде.Метаданные.ТабличныеЧасти цикл
				ПроверитьИЗаполнитьРеквизитыТЧ(ТабЧасть, Запись, СсылкаЗаменитьКого, СсылкаЗаменитьНаКого);
			КонецЦикла;
			
			Если Запись.Проведен Тогда
				Попытка
					Запись.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
				Исключение
					Запись.Записать(РежимЗаписиДокумента.Запись);
				КонецПопытки;
			Иначе
				Запись.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			
		Исключение
			Отказ = Истина;
			Возврат;
		КонецПопытки;
		
		
	ИначеЕсли ЭтоСправочник(СтрокаСсылкаЗаменитьГде.Метаданные) тогда
		
		Попытка 
			
			Запись = СтрокаСсылкаЗаменитьГде.Данные.ПолучитьОбъект();
			ПроверитьИЗаполнитьРеквизиты(СтрокаСсылкаЗаменитьГде.Метаданные.Реквизиты, Запись, СсылкаЗаменитьКого, СсылкаЗаменитьНаКого);
			ПроверитьИЗаполнитьВладельца(Запись, СсылкаЗаменитьКого, СсылкаЗаменитьНаКого);
			Для Каждого ТабЧасть Из СтрокаСсылкаЗаменитьГде.Метаданные.ТабличныеЧасти цикл
				ПроверитьИЗаполнитьРеквизитыТЧ(ТабЧасть, Запись, СсылкаЗаменитьКого, СсылкаЗаменитьНаКого);
			КонецЦикла;
			Запись.Записать();
			
		Исключение
			Отказ = Истина;
			Возврат;
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры
	
Функция НайтиСоздатьДоговорВзаиморасчетов(КонтрагентСсылка, Договор, ОдинаковыйНомер = Ложь) Экспорт
	
	Если ЗначениеЗаполнено(Договор.Организация) Тогда 
		
		ТекОрганизация  = Договор.Организация
		
	Иначе
		
		Если ЗначениеЗаполнено(ПараметрыСеанса.Организация) Тогда
			
			ТекОрганизация = ПараметрыСеанса.Организация;
			
		ИначеЕсли ЗначениеЗаполнено(ПараметрыСеанса.ПодразделениеКомпании) И ЗначениеЗаполнено(ПараметрыСеанса.ПодразделениеКомпании.Организация) Тогда
			
			ТекОрганизация = ПараметрыСеанса.ПодразделениеКомпании.Организация;
			
		ИначеЕсли ЗначениеЗаполнено(Справочники.ПодразделенияКомпании.ОсновноеПодразделение.Организация) Тогда
			
			ТекОрганизация = Справочники.ПодразделенияКомпании.ОсновноеПодразделение.Организация;
			
		Иначе
			
			ТекОрганизация = Справочники.Организации.ОсновнаяОрганизация;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
	Запрос = Новый Запрос("ВЫБРАТЬ
			                   |	ДоговорыВзаиморасчетов.Ссылка
			                   |ИЗ
			                   |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
			                   |ГДЕ
			                   |	ДоговорыВзаиморасчетов.Владелец = &Владелец
			                   |	И ДоговорыВзаиморасчетов.Организация = &Организация
			                   |	И ДоговорыВзаиморасчетов.ВидДоговора = &ВидДоговора");
	Если ОдинаковыйНомер Тогда
		Запрос.Текст = Запрос.Текст + Символы.ПС + "	И ДоговорыВзаиморасчетов.НомерДоговора = &НомерДоговора";
		Запрос.УстановитьПараметр("НомерДоговора", Договор.НомерДоговора);
	КонецЕсли;
							   
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);			   
	Запрос.УстановитьПараметр("Владелец", КонтрагентСсылка);
	Запрос.УстановитьПараметр("Организация", ТекОрганизация);
	Результат = Запрос.Выполнить();
			
	Если Результат.Пустой() Тогда
		
		ДогОбъект = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
		
		ДогОбъект.Владелец = КонтрагентСсылка;
		ДогОбъект.Организация = ТекОрганизация;
		ДогОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
		ДогОбъект.УстановитьНовыйКод();
		ДогОбъект.Подразделение = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
		ДогОбъект.ВидОплаты = Перечисления.ВидыОплаты.БезналичныйРасчет;
		ДогОбъект.ДатаНачала = НачалоГода(ТекущаяДата());
		ДогОбъект.ВалютаВзаиморасчетов = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
		ДогОбъект.Наименование = "Договор №" + ДогОбъект.Код + " с " + КонтрагентСсылка.Наименование;
		Если Метаданные.Справочники["ДоговорыВзаиморасчетов"].Реквизиты.Найти("ДляАвтосалона") <> Неопределено Тогда
			ДогОбъект.ДляАвтосалона = Истина;
		КонецЕсли;

		Если Метаданные.Справочники["ДоговорыВзаиморасчетов"].Реквизиты.Найти("ТипДоговора") <> Неопределено Тогда
  			ДогОбъект.ТипДоговора = Перечисления.ТипыДоговоров.Договор;
		КонецЕсли;
		
		Если ОдинаковыйНомер Тогда
			
			ДогОбъект.НомерДоговора = Договор.НомерДоговора;
			
		КонецЕсли;
		
		Если  Лев(СокрЛП(Метаданные.Версия), 1) = "4" Тогда
			
			ДогОбъект.СпособЗакрытияСделок = Перечисления.СпособЗакрытияСделок.ПоРасчетнымДокументам;
			
		КонецЕсли;
		ДогОбъект.ЕдиницаИзмеренияАвтоработВПечатныхФормах = обПраво("ЕдиницаИзмеренияАвтоработВПечатныхФормах"); // DMSREN-1228
		ДогОбъект.Записать();
		ДогСсылка = ДогОбъект.Ссылка;
		
	Иначе
		
		Выгрузка = Результат.Выгрузить();
		ДогСсылка = Выгрузка[0].Ссылка;
		
	КонецЕсли;
			
	Возврат  ДогСсылка;
	
КонецФункции
